cask_args appdir: '/Applications'

# Bundler for non-Ruby dependencies from Homebrew
# brew tap Homebrew/bundle


# System duplicate formulae
tap 'homebrew/dupes'

# Starts Homebrew formulae's plists with launchctl
tap 'homebrew/services'

# Versioned formulae
tap 'homebrew/versions'


# Mac App Store command line interface
install mas

# A CLI workflow for the administration of Mac applications distributed as binaries http://caskroom.io
install caskroom/cask/brew-cask

tap 'caskroom/cask'
tap 'caskroom/cask-versions'


# Security
cask 'little-snitch'
cask 'micro-snitch'
cask 'lastpass'

# Utilities
cask 'ccleaner'
cask 'google-drive'
cask 'flux'
cask 'spectacle'
brew 'wine'
cask 'macupdate-desktop'
cask 'osxfuse'
cask 'cord'
cask 'the-unarchiver'

# Gaming
cask 'steam'
cask 'origin'
cask 'obs'
#cask 'logmein-hamachi'

# Editors
cask 'atom'
cask 'sublime-text3'
cask 'phpstorm'

# FTP
cask 'Caskroom/cask/filezilla'

# Documents
cask 'libreoffice'
cask 'evernote'

# Entertainment
cask 'vlc'

# Communication
cask 'hipchat'
cask 'skype'

# Development
brew 'git'
brew 'zsh'
brew 'vim'
brew 'curl'
brew 'wget'
brew 'tmux'
brew 'openssl'
brew 'shellcheck'

cask 'iterm2'
cask 'virtualbox'
cask 'vagrant'
cask 'packer'
cask 'terraform'
cask 'otto'
cask 'charles'

brew 'rust'

# Browsers
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'


# Quick look plugins

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

